Tekla Open API Reference for Tekla Structures 2025
Distance.Equals Method
Overload List
Name | Description
Equals(Object)
 Indicates whether the current instance and the specified object are equal.
 (Overrides ValueType.Equals(Object).)
Equals(Distance)
 Indicates whether the current object is equal to another object of the same type.
Top
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace